Revit 2027 API
BuiltInFailures.WallFailures.RecursionParameterIgnored Property
 Parameter-defined type of curtain panels defined in a circular way and will be ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RecursionParameterIgnored { get; }
Public Shared ReadOnly Property RecursionParameterIgnored As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RecursionParameterIgnored {
	FailureDefinitionId^ get ();
}
static member RecursionParameterIgnored : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace